app/Models/UserModel.php

    public function getUsers($id = false)
    {
        $query = $this->select('*');

        // ->where('id', $id);
        if ($id === false) {
            return $query->findAll();
---
SELECT *
FROM `user`